# IIFCImporterServer Interface

---
C#Visual BasicVisual C++
Revit 2024 API
---
IIFCImporterServer Interface
Members See Also
---
Interface for external servers implementing IFC import.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public interface IIFCImporterServer : IExternalServer
```

Visual Basic
---
```text
Public Interface IIFCImporterServer _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class IIFCImporterServer : IExternalServer
```

# See Also
IIFCImporterServer Members
Autodesk.Revit.DB.IFC Namespace